{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "SliceChannel", 
      "name": "slicechannel0", 
      "attr": {"num_outputs": "110"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "i2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l0_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "f_init_h", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l0_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[4, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t0_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation3", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[10, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation2", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[10, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "f_init_c", 
      "inputs": []
    }, 
    {
      "op": "_mul", 
      "name": "_mul0", 
      "inputs": [[12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation0", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation1", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[10, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul1", 
      "inputs": [[15, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[14, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation4", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul2", 
      "inputs": [[11, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t1_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 1, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t2_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 2, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t3_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 3, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t4_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 4, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t5_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 5, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t6_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 6, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t7_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 7, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t8_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 8, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t9_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 9, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t10_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 10, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t11_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 11, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t12_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 12, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t13_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 13, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t14_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 14, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t15_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 15, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t16_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 16, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t17_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 17, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t18_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 18, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t19_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 19, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t20_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 20, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t21_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 21, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t22_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 22, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t23_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 23, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t24_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 24, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t25_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 25, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t26_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 26, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t27_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 27, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t28_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 28, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t29_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 29, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t30_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 30, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t31_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 31, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t32_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 32, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t33_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 33, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t34_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 34, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t35_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 35, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t36_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 36, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t37_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 37, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t38_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 38, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t39_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 39, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t40_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 40, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t41_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 41, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t42_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 42, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t43_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 43, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t44_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 44, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t45_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 45, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t46_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 46, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t47_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 47, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t48_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 48, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t49_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 49, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t50_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 50, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t51_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 51, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t52_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 52, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t53_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 53, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t54_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 54, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t55_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 55, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t56_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 56, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t57_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 57, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t58_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 58, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t59_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 59, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t60_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 60, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t61_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 61, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t62_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 62, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t63_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 63, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t64_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 64, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t65_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 65, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t66_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 66, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t67_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 67, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t68_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 68, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t69_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 69, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t70_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 70, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t71_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 71, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t72_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 72, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t73_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 73, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t74_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 74, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t75_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 75, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t76_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 76, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t77_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 77, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t78_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 78, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t79_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 79, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t80_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 80, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t81_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 81, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t82_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 82, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t83_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 83, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t84_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 84, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t85_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 85, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t86_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 86, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t87_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 87, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t88_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 88, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t89_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 89, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t90_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 90, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t91_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 91, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t92_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 92, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t93_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 93, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t94_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 94, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t95_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 95, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t96_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 96, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t97_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 97, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t98_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 98, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t99_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 99, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t100_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 100, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t101_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 101, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t102_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 102, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t103_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 103, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t104_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 104, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t105_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 105, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t106_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 106, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t107_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 107, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t108_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 108, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t109_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 109, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "b_init_h", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t109_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[131, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus220", 
      "inputs": [[130, 0, 0], [132, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t109_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[133, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation553", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[134, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation552", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[134, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "b_init_c", 
      "inputs": []
    }, 
    {
      "op": "_mul", 
      "name": "_mul330", 
      "inputs": [[136, 0, 0], [137, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation550", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[134, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation551", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[134, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul331", 
      "inputs": [[139, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus221", 
      "inputs": [[138, 0, 0], [141, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation554", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[142, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul332", 
      "inputs": [[135, 0, 0], [143, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t108_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[144, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus222", 
      "inputs": [[129, 0, 0], [145, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t108_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[146, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation558", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[147, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation557", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[147, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul333", 
      "inputs": [[149, 0, 0], [142, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation555", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[147, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation556", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[147, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul334", 
      "inputs": [[151, 0, 0], [152, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus223", 
      "inputs": [[150, 0, 0], [153, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation559", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[154, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul335", 
      "inputs": [[148, 0, 0], [155, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t107_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[156, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus224", 
      "inputs": [[128, 0, 0], [157, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t107_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[158, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation563", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[159, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation562", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[159, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul336", 
      "inputs": [[161, 0, 0], [154, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation560", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[159, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation561", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[159, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul337", 
      "inputs": [[163, 0, 0], [164, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus225", 
      "inputs": [[162, 0, 0], [165, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation564", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[166, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul338", 
      "inputs": [[160, 0, 0], [167, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t106_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[168, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus226", 
      "inputs": [[127, 0, 0], [169, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t106_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[170, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation568", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[171, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation567", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[171, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul339", 
      "inputs": [[173, 0, 0], [166, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation565", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[171, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation566", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[171, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul340", 
      "inputs": [[175, 0, 0], [176, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus227", 
      "inputs": [[174, 0, 0], [177, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation569", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[178, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul341", 
      "inputs": [[172, 0, 0], [179, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t105_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[180, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus228", 
      "inputs": [[126, 0, 0], [181, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t105_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[182, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation573", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[183, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation572", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[183, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul342", 
      "inputs": [[185, 0, 0], [178, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation570", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[183, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation571", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[183, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul343", 
      "inputs": [[187, 0, 0], [188, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus229", 
      "inputs": [[186, 0, 0], [189, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation574", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[190, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul344", 
      "inputs": [[184, 0, 0], [191, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t104_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[192, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus230", 
      "inputs": [[125, 0, 0], [193, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t104_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[194, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation578", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[195, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation577", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[195, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul345", 
      "inputs": [[197, 0, 0], [190, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation575", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[195, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation576", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[195, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul346", 
      "inputs": [[199, 0, 0], [200, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus231", 
      "inputs": [[198, 0, 0], [201, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation579", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[202, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul347", 
      "inputs": [[196, 0, 0], [203, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t103_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[204, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus232", 
      "inputs": [[124, 0, 0], [205, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t103_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[206, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation583", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[207, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation582", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[207, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul348", 
      "inputs": [[209, 0, 0], [202, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation580", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[207, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation581", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[207, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul349", 
      "inputs": [[211, 0, 0], [212, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus233", 
      "inputs": [[210, 0, 0], [213, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation584", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[214, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul350", 
      "inputs": [[208, 0, 0], [215, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t102_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[216, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus234", 
      "inputs": [[123, 0, 0], [217, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t102_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[218, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation588", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[219, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation587", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[219, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul351", 
      "inputs": [[221, 0, 0], [214, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation585", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[219, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation586", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[219, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul352", 
      "inputs": [[223, 0, 0], [224, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus235", 
      "inputs": [[222, 0, 0], [225, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation589", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[226, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul353", 
      "inputs": [[220, 0, 0], [227, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t101_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[228, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus236", 
      "inputs": [[122, 0, 0], [229, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t101_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[230, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation593", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[231, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation592", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[231, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul354", 
      "inputs": [[233, 0, 0], [226, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation590", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[231, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation591", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[231, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul355", 
      "inputs": [[235, 0, 0], [236, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus237", 
      "inputs": [[234, 0, 0], [237, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation594", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[238, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul356", 
      "inputs": [[232, 0, 0], [239, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t100_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[240, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus238", 
      "inputs": [[121, 0, 0], [241, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t100_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[242, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation598", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[243, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation597", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[243, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul357", 
      "inputs": [[245, 0, 0], [238, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation595", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[243, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation596", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[243, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul358", 
      "inputs": [[247, 0, 0], [248, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus239", 
      "inputs": [[246, 0, 0], [249, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation599", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[250, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul359", 
      "inputs": [[244, 0, 0], [251, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t99_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[252, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus240", 
      "inputs": [[120, 0, 0], [253, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t99_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[254, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation603", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[255, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation602", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[255, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul360", 
      "inputs": [[257, 0, 0], [250, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation600", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[255, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation601", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[255, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul361", 
      "inputs": [[259, 0, 0], [260, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus241", 
      "inputs": [[258, 0, 0], [261, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation604", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[262, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul362", 
      "inputs": [[256, 0, 0], [263, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t98_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[264, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus242", 
      "inputs": [[119, 0, 0], [265, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t98_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[266, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation608", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[267, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation607", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[267, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul363", 
      "inputs": [[269, 0, 0], [262, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation605", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[267, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation606", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[267, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul364", 
      "inputs": [[271, 0, 0], [272, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus243", 
      "inputs": [[270, 0, 0], [273, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation609", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[274, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul365", 
      "inputs": [[268, 0, 0], [275, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t97_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[276, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus244", 
      "inputs": [[118, 0, 0], [277, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t97_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[278, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation613", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[279, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation612", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[279, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul366", 
      "inputs": [[281, 0, 0], [274, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation610", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[279, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation611", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[279, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul367", 
      "inputs": [[283, 0, 0], [284, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus245", 
      "inputs": [[282, 0, 0], [285, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation614", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[286, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul368", 
      "inputs": [[280, 0, 0], [287, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t96_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[288, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus246", 
      "inputs": [[117, 0, 0], [289, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t96_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[290, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation618", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[291, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation617", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[291, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul369", 
      "inputs": [[293, 0, 0], [286, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation615", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[291, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation616", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[291, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul370", 
      "inputs": [[295, 0, 0], [296, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus247", 
      "inputs": [[294, 0, 0], [297, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation619", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[298, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul371", 
      "inputs": [[292, 0, 0], [299, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t95_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[300, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus248", 
      "inputs": [[116, 0, 0], [301, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t95_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[302, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation623", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[303, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation622", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[303, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul372", 
      "inputs": [[305, 0, 0], [298, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation620", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[303, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation621", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[303, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul373", 
      "inputs": [[307, 0, 0], [308, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus249", 
      "inputs": [[306, 0, 0], [309, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation624", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[310, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul374", 
      "inputs": [[304, 0, 0], [311, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t94_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[312, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus250", 
      "inputs": [[115, 0, 0], [313, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t94_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[314, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation628", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[315, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation627", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[315, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul375", 
      "inputs": [[317, 0, 0], [310, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation625", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[315, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation626", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[315, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul376", 
      "inputs": [[319, 0, 0], [320, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus251", 
      "inputs": [[318, 0, 0], [321, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation629", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[322, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul377", 
      "inputs": [[316, 0, 0], [323, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t93_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[324, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus252", 
      "inputs": [[114, 0, 0], [325, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t93_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[326, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation633", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[327, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation632", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[327, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul378", 
      "inputs": [[329, 0, 0], [322, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation630", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[327, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation631", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[327, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul379", 
      "inputs": [[331, 0, 0], [332, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus253", 
      "inputs": [[330, 0, 0], [333, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation634", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[334, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul380", 
      "inputs": [[328, 0, 0], [335, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t92_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[336, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus254", 
      "inputs": [[113, 0, 0], [337, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t92_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[338, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation638", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[339, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation637", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[339, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul381", 
      "inputs": [[341, 0, 0], [334, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation635", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[339, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation636", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[339, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul382", 
      "inputs": [[343, 0, 0], [344, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus255", 
      "inputs": [[342, 0, 0], [345, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation639", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[346, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul383", 
      "inputs": [[340, 0, 0], [347, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t91_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[348, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus256", 
      "inputs": [[112, 0, 0], [349, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t91_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[350, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation643", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[351, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation642", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[351, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul384", 
      "inputs": [[353, 0, 0], [346, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation640", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[351, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation641", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[351, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul385", 
      "inputs": [[355, 0, 0], [356, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus257", 
      "inputs": [[354, 0, 0], [357, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation644", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[358, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul386", 
      "inputs": [[352, 0, 0], [359, 0, 0]]
    }, 
    {
