{
  "nodes": [
    {
      "op": "null", 
      "param": {}, 
      "name": "data", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {
        "axis": "1", 
        "num_outputs": "110", 
        "squeeze_axis": "True"
      }, 
      "name": "slicechannel0", 
      "inputs": [[0, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "i2h_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "i2h_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t0_l0_i2h", 
      "inputs": [[1, 0], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "f_init_h", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "h2h_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "h2h_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t0_l0_h2h", 
      "inputs": [[5, 0], [6, 0], [7, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus0", 
      "inputs": [[4, 0], [8, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {
        "axis": "1", 
        "num_outputs": "4", 
        "squeeze_axis": "False"
      }, 
      "name": "t0_l0_slice", 
      "inputs": [[9, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation3", 
      "inputs": [[10, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation2", 
      "inputs": [[10, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "f_init_c", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul0", 
      "inputs": [[12, 0], [13, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation0", 
      "inputs": [[10, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation1", 
      "inputs": [[10, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul1", 
      "inputs": [[15, 0], [16, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus1", 
      "inputs": [[14, 0], [17, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation4", 
      "inputs": [[18, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul2", 
      "inputs": [[11, 0], [19, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t0_l1_i2h", 
      "inputs": [[1, 0], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t1_l1_i2h", 
      "inputs": [[1, 1], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t2_l1_i2h", 
      "inputs": [[1, 2], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t3_l1_i2h", 
      "inputs": [[1, 3], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t4_l1_i2h", 
      "inputs": [[1, 4], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t5_l1_i2h", 
      "inputs": [[1, 5], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t6_l1_i2h", 
      "inputs": [[1, 6], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t7_l1_i2h", 
      "inputs": [[1, 7], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t8_l1_i2h", 
      "inputs": [[1, 8], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t9_l1_i2h", 
      "inputs": [[1, 9], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t10_l1_i2h", 
      "inputs": [[1, 10], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t11_l1_i2h", 
      "inputs": [[1, 11], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t12_l1_i2h", 
      "inputs": [[1, 12], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t13_l1_i2h", 
      "inputs": [[1, 13], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t14_l1_i2h", 
      "inputs": [[1, 14], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t15_l1_i2h", 
      "inputs": [[1, 15], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t16_l1_i2h", 
      "inputs": [[1, 16], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t17_l1_i2h", 
      "inputs": [[1, 17], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t18_l1_i2h", 
      "inputs": [[1, 18], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t19_l1_i2h", 
      "inputs": [[1, 19], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t20_l1_i2h", 
      "inputs": [[1, 20], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t21_l1_i2h", 
      "inputs": [[1, 21], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t22_l1_i2h", 
      "inputs": [[1, 22], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t23_l1_i2h", 
      "inputs": [[1, 23], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t24_l1_i2h", 
      "inputs": [[1, 24], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t25_l1_i2h", 
      "inputs": [[1, 25], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t26_l1_i2h", 
      "inputs": [[1, 26], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t27_l1_i2h", 
      "inputs": [[1, 27], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t28_l1_i2h", 
      "inputs": [[1, 28], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t29_l1_i2h", 
      "inputs": [[1, 29], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t30_l1_i2h", 
      "inputs": [[1, 30], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t31_l1_i2h", 
      "inputs": [[1, 31], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t32_l1_i2h", 
      "inputs": [[1, 32], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t33_l1_i2h", 
      "inputs": [[1, 33], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t34_l1_i2h", 
      "inputs": [[1, 34], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t35_l1_i2h", 
      "inputs": [[1, 35], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t36_l1_i2h", 
      "inputs": [[1, 36], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t37_l1_i2h", 
      "inputs": [[1, 37], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t38_l1_i2h", 
      "inputs": [[1, 38], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t39_l1_i2h", 
      "inputs": [[1, 39], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t40_l1_i2h", 
      "inputs": [[1, 40], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t41_l1_i2h", 
      "inputs": [[1, 41], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t42_l1_i2h", 
      "inputs": [[1, 42], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t43_l1_i2h", 
      "inputs": [[1, 43], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t44_l1_i2h", 
      "inputs": [[1, 44], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t45_l1_i2h", 
      "inputs": [[1, 45], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t46_l1_i2h", 
      "inputs": [[1, 46], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t47_l1_i2h", 
      "inputs": [[1, 47], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t48_l1_i2h", 
      "inputs": [[1, 48], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t49_l1_i2h", 
      "inputs": [[1, 49], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t50_l1_i2h", 
      "inputs": [[1, 50], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t51_l1_i2h", 
      "inputs": [[1, 51], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t52_l1_i2h", 
      "inputs": [[1, 52], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t53_l1_i2h", 
      "inputs": [[1, 53], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t54_l1_i2h", 
      "inputs": [[1, 54], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t55_l1_i2h", 
      "inputs": [[1, 55], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t56_l1_i2h", 
      "inputs": [[1, 56], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t57_l1_i2h", 
      "inputs": [[1, 57], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t58_l1_i2h", 
      "inputs": [[1, 58], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t59_l1_i2h", 
      "inputs": [[1, 59], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t60_l1_i2h", 
      "inputs": [[1, 60], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t61_l1_i2h", 
      "inputs": [[1, 61], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t62_l1_i2h", 
      "inputs": [[1, 62], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t63_l1_i2h", 
      "inputs": [[1, 63], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t64_l1_i2h", 
      "inputs": [[1, 64], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t65_l1_i2h", 
      "inputs": [[1, 65], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t66_l1_i2h", 
      "inputs": [[1, 66], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t67_l1_i2h", 
      "inputs": [[1, 67], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t68_l1_i2h", 
      "inputs": [[1, 68], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t69_l1_i2h", 
      "inputs": [[1, 69], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t70_l1_i2h", 
      "inputs": [[1, 70], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t71_l1_i2h", 
      "inputs": [[1, 71], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t72_l1_i2h", 
      "inputs": [[1, 72], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t73_l1_i2h", 
      "inputs": [[1, 73], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t74_l1_i2h", 
      "inputs": [[1, 74], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t75_l1_i2h", 
      "inputs": [[1, 75], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t76_l1_i2h", 
      "inputs": [[1, 76], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t77_l1_i2h", 
      "inputs": [[1, 77], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t78_l1_i2h", 
      "inputs": [[1, 78], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t79_l1_i2h", 
      "inputs": [[1, 79], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t80_l1_i2h", 
      "inputs": [[1, 80], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t81_l1_i2h", 
      "inputs": [[1, 81], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t82_l1_i2h", 
      "inputs": [[1, 82], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t83_l1_i2h", 
      "inputs": [[1, 83], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t84_l1_i2h", 
      "inputs": [[1, 84], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t85_l1_i2h", 
      "inputs": [[1, 85], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t86_l1_i2h", 
      "inputs": [[1, 86], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t87_l1_i2h", 
      "inputs": [[1, 87], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t88_l1_i2h", 
      "inputs": [[1, 88], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t89_l1_i2h", 
      "inputs": [[1, 89], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t90_l1_i2h", 
      "inputs": [[1, 90], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t91_l1_i2h", 
      "inputs": [[1, 91], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t92_l1_i2h", 
      "inputs": [[1, 92], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t93_l1_i2h", 
      "inputs": [[1, 93], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t94_l1_i2h", 
      "inputs": [[1, 94], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t95_l1_i2h", 
      "inputs": [[1, 95], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t96_l1_i2h", 
      "inputs": [[1, 96], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t97_l1_i2h", 
      "inputs": [[1, 97], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t98_l1_i2h", 
      "inputs": [[1, 98], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t99_l1_i2h", 
      "inputs": [[1, 99], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t100_l1_i2h", 
      "inputs": [[1, 100], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t101_l1_i2h", 
      "inputs": [[1, 101], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t102_l1_i2h", 
      "inputs": [[1, 102], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t103_l1_i2h", 
      "inputs": [[1, 103], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t104_l1_i2h", 
      "inputs": [[1, 104], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t105_l1_i2h", 
      "inputs": [[1, 105], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t106_l1_i2h", 
      "inputs": [[1, 106], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t107_l1_i2h", 
      "inputs": [[1, 107], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t108_l1_i2h", 
      "inputs": [[1, 108], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t109_l1_i2h", 
      "inputs": [[1, 109], [2, 0], [3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "b_init_h", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t109_l1_h2h", 
      "inputs": [[131, 0], [6, 0], [7, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus220", 
      "inputs": [[130, 0], [132, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {
        "axis": "1", 
        "num_outputs": "4", 
        "squeeze_axis": "False"
      }, 
      "name": "t109_l1_slice", 
      "inputs": [[133, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation553", 
      "inputs": [[134, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation552", 
      "inputs": [[134, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "b_init_c", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul330", 
      "inputs": [[136, 0], [137, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation550", 
      "inputs": [[134, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation551", 
      "inputs": [[134, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul331", 
      "inputs": [[139, 0], [140, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus221", 
      "inputs": [[138, 0], [141, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation554", 
      "inputs": [[142, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul332", 
      "inputs": [[135, 0], [143, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t108_l1_h2h", 
      "inputs": [[144, 0], [6, 0], [7, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus222", 
      "inputs": [[129, 0], [145, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {
        "axis": "1", 
        "num_outputs": "4", 
        "squeeze_axis": "False"
      }, 
      "name": "t108_l1_slice", 
      "inputs": [[146, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation558", 
      "inputs": [[147, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation557", 
      "inputs": [[147, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul333", 
      "inputs": [[149, 0], [142, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation555", 
      "inputs": [[147, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation556", 
      "inputs": [[147, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul334", 
      "inputs": [[151, 0], [152, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus223", 
      "inputs": [[150, 0], [153, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation559", 
      "inputs": [[154, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul335", 
      "inputs": [[148, 0], [155, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t107_l1_h2h", 
      "inputs": [[156, 0], [6, 0], [7, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus224", 
      "inputs": [[128, 0], [157, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {
        "axis": "1", 
        "num_outputs": "4", 
        "squeeze_axis": "False"
      }, 
      "name": "t107_l1_slice", 
      "inputs": [[158, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation563", 
      "inputs": [[159, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation562", 
      "inputs": [[159, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul336", 
      "inputs": [[161, 0], [154, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation560", 
      "inputs": [[159, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation561", 
      "inputs": [[159, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul337", 
      "inputs": [[163, 0], [164, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus225", 
      "inputs": [[162, 0], [165, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation564", 
      "inputs": [[166, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul338", 
      "inputs": [[160, 0], [167, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t106_l1_h2h", 
      "inputs": [[168, 0], [6, 0], [7, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus226", 
      "inputs": [[127, 0], [169, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {
        "axis": "1", 
        "num_outputs": "4", 
        "squeeze_axis": "False"
      }, 
      "name": "t106_l1_slice", 
      "inputs": [[170, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation568", 
      "inputs": [[171, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation567", 
      "inputs": [[171, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul339", 
      "inputs": [[173, 0], [166, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation565", 
      "inputs": [[171, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation566", 
      "inputs": [[171, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul340", 
      "inputs": [[175, 0], [176, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus227", 
      "inputs": [[174, 0], [177, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation569", 
      "inputs": [[178, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul341", 
      "inputs": [[172, 0], [179, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t105_l1_h2h", 
      "inputs": [[180, 0], [6, 0], [7, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus228", 
      "inputs": [[126, 0], [181, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {
        "axis": "1", 
        "num_outputs": "4", 
        "squeeze_axis": "False"
      }, 
      "name": "t105_l1_slice", 
      "inputs": [[182, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation573", 
      "inputs": [[183, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation572", 
      "inputs": [[183, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul342", 
      "inputs": [[185, 0], [178, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation570", 
      "inputs": [[183, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation571", 
      "inputs": [[183, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul343", 
      "inputs": [[187, 0], [188, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus229", 
      "inputs": [[186, 0], [189, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation574", 
      "inputs": [[190, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul344", 
      "inputs": [[184, 0], [191, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t104_l1_h2h", 
      "inputs": [[192, 0], [6, 0], [7, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus230", 
      "inputs": [[125, 0], [193, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {
        "axis": "1", 
        "num_outputs": "4", 
        "squeeze_axis": "False"
      }, 
      "name": "t104_l1_slice", 
      "inputs": [[194, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation578", 
      "inputs": [[195, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation577", 
      "inputs": [[195, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul345", 
      "inputs": [[197, 0], [190, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation575", 
      "inputs": [[195, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation576", 
      "inputs": [[195, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul346", 
      "inputs": [[199, 0], [200, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus231", 
      "inputs": [[198, 0], [201, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation579", 
      "inputs": [[202, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul347", 
      "inputs": [[196, 0], [203, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t103_l1_h2h", 
      "inputs": [[204, 0], [6, 0], [7, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus232", 
      "inputs": [[124, 0], [205, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {
        "axis": "1", 
        "num_outputs": "4", 
        "squeeze_axis": "False"
      }, 
      "name": "t103_l1_slice", 
      "inputs": [[206, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation583", 
      "inputs": [[207, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation582", 
      "inputs": [[207, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul348", 
      "inputs": [[209, 0], [202, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation580", 
      "inputs": [[207, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation581", 
      "inputs": [[207, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul349", 
      "inputs": [[211, 0], [212, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus233", 
      "inputs": [[210, 0], [213, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation584", 
      "inputs": [[214, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul350", 
      "inputs": [[208, 0], [215, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t102_l1_h2h", 
      "inputs": [[216, 0], [6, 0], [7, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus234", 
      "inputs": [[123, 0], [217, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {
        "axis": "1", 
        "num_outputs": "4", 
        "squeeze_axis": "False"
      }, 
      "name": "t102_l1_slice", 
      "inputs": [[218, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation588", 
      "inputs": [[219, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation587", 
      "inputs": [[219, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul351", 
      "inputs": [[221, 0], [214, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation585", 
      "inputs": [[219, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation586", 
      "inputs": [[219, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul352", 
      "inputs": [[223, 0], [224, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus235", 
      "inputs": [[222, 0], [225, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation589", 
      "inputs": [[226, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul353", 
      "inputs": [[220, 0], [227, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t101_l1_h2h", 
      "inputs": [[228, 0], [6, 0], [7, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus236", 
      "inputs": [[122, 0], [229, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {
        "axis": "1", 
        "num_outputs": "4", 
        "squeeze_axis": "False"
      }, 
      "name": "t101_l1_slice", 
      "inputs": [[230, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation593", 
      "inputs": [[231, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation592", 
      "inputs": [[231, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul354", 
      "inputs": [[233, 0], [226, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation590", 
      "inputs": [[231, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation591", 
      "inputs": [[231, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul355", 
      "inputs": [[235, 0], [236, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus237", 
      "inputs": [[234, 0], [237, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation594", 
      "inputs": [[238, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul356", 
      "inputs": [[232, 0], [239, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "512"
      }, 
      "name": "t100_l1_h2h", 
      "inputs": [[240, 0], [6, 0], [7, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus238", 
      "inputs": [[121, 0], [241, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {
        "axis": "1", 
        "num_outputs": "4", 
        "squeeze_axis": "False"
      }, 
      "name": "t100_l1_slice", 
      "inputs": [[242, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation598", 
      "inputs": [[243, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation597", 
      "inputs": [[243, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul357", 
      "inputs": [[245, 0], [238, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation595", 
      "inputs": [[243, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation596", 
      "inputs": [[243, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul358", 
      "inputs": [[247, 0], [248, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
